
Процедура ПриЗаписи(Отказ)
	МассивТипов=Новый Массив;
	МассивТипов.Добавить(ЭтотОбъект.Ссылка);
	
	
	Запрос=Новый Запрос("
	| SELECT DISTINCT
	|    Ссылка
	| FROM
	|    Справочник.ОбменДаннымиТипыДанных.Данные
	| WHERE
	|    ТипДанных IN (&МассивТипов)
	|    AND Ссылка NOT IN (&МассивТипов)
	|");
	
	Пока Истина Цикл
		Запрос.УстановитьПараметр("МассивТипов",МассивТипов);
		Рез=Запрос.Выполнить();
		Если Рез.Пустой() Тогда
		    Прервать;	
		КонецЕсли;	
		Выб=Рез.Выбрать();
		Пока Выб.Следующий() Цикл
			МассивТипов.Добавить(Выб.Ссылка);
		КонецЦикла;	
	КонецЦикла;	
	
	Запрос.Текст="
	| SELECT
	|    Ссылка
	| FROM
	|    Справочник.ОбменДаннымиВидыСообщений.Данные
	| WHERE
	|    ТипДанных IN (&МассивТипов)
	|";
	
	Запрос.УстановитьПараметр("МассивТипов",МассивТипов);
	
	Выб=Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		МенЗап=РегистрыСведений.ОбменДаннымиЗапросыСКЛ.СоздатьМенеджерЗаписи();
		МенЗап.ВидСообщения=Выб.Ссылка;
		МенЗап.Прочитать();
		МенЗап.ВидСообщения=Выб.Ссылка;
		МенЗап.Записать(Истина);
	КонецЦикла;	
КонецПроцедуры
