


// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьСтруктуруКДСотрудника(Параметр)
     СТрокаНачислений = Новый Структура("СтруктурнаяЕдиница,Сотрудник,Должность");
		Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ первые 1
	|	ТекущиеКадровыеДанныеСотрудниковУНФ.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТекущиеКадровыеДанныеСотрудниковУНФ.Сотрудник КАК Сотрудник,
	|	ТекущиеКадровыеДанныеСотрудниковУНФ.ДатаПриема КАК ДатаПриема,
	|	ТекущиеКадровыеДанныеСотрудниковУНФ.ДатаУвольнения КАК ДатаУвольнения,
	|	ТекущиеКадровыеДанныеСотрудниковУНФ.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТекущиеКадровыеДанныеСотрудниковУНФ.ТекущаяДолжность КАК ТекущаяДолжность,
	|	ТекущиеКадровыеДанныеСотрудниковУНФ.ТекущаяТарифнаяСтавка КАК ТекущаяТарифнаяСтавка,
	|	ТекущиеКадровыеДанныеСотрудниковУНФ.ВалютаТарифнойСтавки КАК ВалютаТарифнойСтавки,
	|	ТекущиеКадровыеДанныеСотрудниковУНФ.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудниковУНФ КАК ТекущиеКадровыеДанныеСотрудниковУНФ
	|ГДЕ
	|	ТекущиеКадровыеДанныеСотрудниковУНФ.Сотрудник.Физлицо.ИНН = &ИНН
	//|	ТекущиеКадровыеДанныеСотрудниковУНФ.Сотрудник.Физлицо.Наименование = &Наименование
	//	|	(ТекущиеКадровыеДанныеСотрудниковУНФ.Сотрудник.Физлицо.ИНН = &ИНН или ТекущиеКадровыеДанныеСотрудниковУНФ.Сотрудник.Физлицо.СтраховойНомерПФР = &СтраховойНомерПФР или ТекущиеКадровыеДанныеСотрудниковУНФ.Сотрудник.Физлицо.Наименование = &Наименование )
	|	И ТекущиеКадровыеДанныеСотрудниковУНФ.ДатаУвольнения = &ДатаУвольнения";
	Запрос.УстановитьПараметр("ДатаУвольнения",Дата(1,1,1));
	//	Запрос.УстановитьПараметр("СтраховойНомерПФР",Начисление.Сотрудник.Значение.ФизическоеЛицо.Значение.СтраховойНомерПФР);
		Запрос.УстановитьПараметр("ИНН",Параметр);
	//Запрос.УстановитьПараметр("Наименование",Начисление.Сотрудник.Значение.ФизическоеЛицо.Значение.Description );
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СТрокаНачислений.СтруктурнаяЕдиница   =   Выборка.СтруктурнаяЕдиница;
		СТрокаНачислений.Сотрудник    =   Выборка.Сотрудник;
		СТрокаНачислений.Должность     =   Выборка.ТекущаяДолжность;
	Иначе
		СТрокаНачислений.СтруктурнаяЕдиница   =   Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
		СТрокаНачислений.Сотрудник    =   Справочники.Сотрудники.ПустаяСсылка();
		СТрокаНачислений.Должность     =   Справочники.Должности.ПустаяСсылка();
	КонецЕсли;
       Возврат СТрокаНачислений;
КонецФункции // ()
  