&НаКлиенте
Процедура ВызватьРедакторКода(Команда)
	ПараметрыФормы=Новый Структура;
	ПараметрыФормы.Вставить("Алгоритм", Объект.Алгоритм);
	ОткрытьФорму("Обработка.РедакторКода.Форма.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор,,, Новый ОписаниеОповещения("ОбработчикОповещения_Результат", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповещения_Результат(Параметр1, Параметр2) Экспорт
	Если Параметр1=Неопределено Тогда Возврат; КонецЕсли;	
	Объект.Алгоритм=Параметр1;
КонецПроцедуры