&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	РедакторКодаКлиент.ВыполнитьДействие(Команда, Элементы.HTML, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Закрыть(РедакторКодаКлиент.ПолучитьТекст(Элементы.HTML));
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// Обработчики событий редактора (ПолеHTML)

&НаКлиенте
Процедура ПолеHTML_Сформирован(Элемент)
	РедакторКодаКлиент.ПолеHTML_Сформирован(Элемент, ЭтаФорма);
	РедакторКодаКлиент.УстановитьТекст(Элемент, Алгоритм, 1, Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTML_ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	РедакторКодаКлиент.ПолеHTML_ПриНажатии(Элемент, ЭтаФорма, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Алгоритм") Тогда
		Алгоритм=Параметры.Алгоритм;
		Элементы.Выбрать.Видимость=Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	HTML=РедакторКодаКлиент.Инициализация();
КонецПроцедуры